from typing import KeysView, List

# ---------------------------------------------------------------------------------------------------------------------------------#
# 1 - Criar um dicíonario vazio e imprimi-lo:
# ---------------------------------------------------------------------------------------------------------------------------------#

meu_dicionario = {}
print(meu_dicionario)

# ---------------------------------------------------------------------------------------------------------------------------------#
# 2 - Criar um dicíonario que irá conter dados de uma pessoa. Com: nome, idade, e-mail, cpf.
# ---------------------------------------------------------------------------------------------------------------------------------#

dados_pessoais = {'Nome': 'Leonardo', 'Idade': 24, 'email': 'leonardo@hotmail.com', 'cpf': 41021021082}
print(dados_pessoais)

# ---------------------------------------------------------------------------------------------------------------------------------#
# 3 - Pegar esse dicionario criado no exercicio 3 e crie uma função que receba um dicionario e imprima o nomda pessoa e o e-mail.
# ---------------------------------------------------------------------------------------------------------------------------------#

def impressao_nome_email(dados: dict): 
    print(dados['Nome'])
    print(dados['email'])

impressao_nome_email(dados_pessoais)

# ---------------------------------------------------------------------------------------------------------------------------------#
# 4 - Pegar esse dicionário que você criou no ex 3 e remova a chave de cpf.
## ---------------------------------------------------------------------------------------------------------------------------------#

del dados_pessoais ['cpf']
print(dados_pessoais)

# ---------------------------------------------------------------------------------------------------------------------------------#
# 5 - Pegue o dicionário do exercício 3 e imprima todas as chaves do dicionário utilizando o for e o método keys()
# ---------------------------------------------------------------------------------------------------------------------------------#

for chaves in dados_pessoais:
    print(dados_pessoais.keys())
    break

# ---------------------------------------------------------------------------------------------------------------------------------#
# 6- Pegue o dicionário do exercício 3 e imprima todas os valores do dicionário utilizando o for e o método values()
# ---------------------------------------------------------------------------------------------------------------------------------#

for chaves in dados_pessoais:
    print(dados_pessoais.values())
    break

# ---------------------------------------------------------------------------------------------------------------------------------#
# 7 - Pegue o dicionário do exercício 3 e imprima quantas chaves tem no dicionário utilizando a função len().
# ---------------------------------------------------------------------------------------------------------------------------------#

print(len(dados_pessoais))

# ---------------------------------------------------------------------------------------------------------------------------------#
# 8 - Adicione a chave peso e altura no dicionário do exercício 3.
# ---------------------------------------------------------------------------------------------------------------------------------#

dados_pessoais['peso'] = 67
dados_pessoais['altura'] = 1.79
print(dados_pessoais)

# ---------------------------------------------------------------------------------------------------------------------------------#
# 9 - Crie 3 dicionários que representam dados de pessoas, cada um com chaves: nome, altura e peso. Crie uma lista vazia e adicione 
# cada um desses 3 dicionários e calcule a média de altura e peso dos 3 dicionários
# ---------------------------------------------------------------------------------------------------------------------------------#


dicionario1 = {'nome' : 'Leonardo', 'altura' : 1.80, 'peso' : 60}
dicionario2 = {'nome' : 'Edivane', 'altura' : 1.60, 'peso' : 56}
dicionario3 = {'nome' : 'Mateo', 'altura' : 1.85, 'peso' : 80}

Lista = [] 

Lista.append(dicionario1)
Lista.append(dicionario2)
Lista.append(dicionario3)

media_altura = (Lista[0]['altura'] + Lista[1]['altura'] + Lista[2]['altura']) / 3
print(f"A média da altura é: {media_altura}")

soma_peso = (Lista[0]['peso'] + Lista[1]['peso'] + Lista[2]['peso']) 
print(f"A soma do peso é: {soma_peso} quilos.")

# ---------------------------------------------------------------------------------------------------------------------------------#
# 10 - Criar um conjunto vazio no python e imprimir
# ---------------------------------------------------------------------------------------------------------------------------------#

conjunto = []
conjunto2 = set (conjunto)

# ---------------------------------------------------------------------------------------------------------------------------------#
# 11 - Criar um conjunto com 1 2 3 4 5 números inteiros e imprimir
# ---------------------------------------------------------------------------------------------------------------------------------#

y = [1,2,3,4,5]
numeros1 = set(y)
print(numeros1)

# ---------------------------------------------------------------------------------------------------------------------------------#
# 12 - Adicionar 6 no conjunto do ex 12 e imprimir
# ---------------------------------------------------------------------------------------------------------------------------------#

numeros1.add(6)
print(numeros1)

# ---------------------------------------------------------------------------------------------------------------------------------#
# 13 - Adicionar 1 no conjunto do ex 12 (Teve diferença?) e imprimir
# ---------------------------------------------------------------------------------------------------------------------------------#

numeros1.add(1)
print(numeros1)

# ---------------------------------------------------------------------------------------------------------------------------------#
# 11 - Criar um conjunto com 4 5 6 7 8 9 e fazer a união utilizando .union() com o conjunto do ex 12 e imprimir
# ---------------------------------------------------------------------------------------------------------------------------------#

x = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
numeros3 = set (x)
numeros3.union(numeros1)
print(numeros3)

# ---------------------------------------------------------------------------------------------------------------------------------#
# 13 - Pegar a união dos conjuntos criada no ex 15 e percorrer com um for e imprimir cada elemento.
# ---------------------------------------------------------------------------------------------------------------------------------#

for impressao in numeros3:
    print(impressao)














